Catalogs/ВариантыОбеспеченияПерсоналомАутсорсинг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ВариантыОбеспеченияПерсоналомАутсорсинг</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ОбеспечениеПерсоналом</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолжностиВнештатныхСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧеловек</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоСмены</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеСмены</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВариантыОбеспеченияПерсоналомАутсорсинг/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Не ПолныеПрава() Тогда
		Отказ=Истина;
		Сообщить("Недостаточно прав!");
	КонецЕсли; 	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолныеПрава()
	Возврат РольДоступна("ПолныеПрава");	
КонецФункции // ()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыОбеспеченияПерсоналомАутсорсингОбеспечениеПерсоналом.Должность.Наименование КАК ДолжностьНаименование
		|ИЗ
		|	Справочник.ВариантыОбеспеченияПерсоналомАутсорсинг.ОбеспечениеПерсоналом КАК ВариантыОбеспеченияПерсоналомАутсорсингОбеспечениеПерсоналом
		|ГДЕ
		|	ВариантыОбеспеченияПерсоналомАутсорсингОбеспечениеПерсоналом.Должность <> &Должность
		|
		|СГРУППИРОВАТЬ ПО
		|	ВариантыОбеспеченияПерсоналомАутсорсингОбеспечениеПерсоналом.Должность.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДолжностьНаименование";
    Запрос.УстановитьПараметр("Должность",Справочники.ДолжностиВнештатныхСотрудников.ПустаяСсылка());
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
    ТипРеквизита=Новый Массив;
	ТипРеквизита.Добавить(Тип("ДинамическийСписок"));
	ОпТипа=Новый ОписаниеТипов(ТипРеквизита);
	
	НовыйРекв=Новый РеквизитФормы("СписокДин",ОпТипа,,"Список вариантов",Истина);
	ДобРекв=Новый Массив;
	ДобРекв.Добавить(НовыйРекв);
	ИзменитьРеквизиты(ДобРекв);
	
	РеквизитСписок=ЭтаФорма["СписокДин"];
	
	
	
	Текст1="";
	Текст2="";
	Сч=0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сч=Сч+1;
		Текст1=Текст1+"
		|"+ ",Сумма(ВариантыОбеспеченияПерсоналомАутсорсингОбеспечениеПерсоналом"+Строка(Сч)+".КоличествоЧеловек) как "+СтрЗаменить(ВыборкаДетальныеЗаписи.ДолжностьНаименование," ","");
		Текст2=Текст2+"
        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыОбеспеченияПерсоналомАутсорсинг.ОбеспечениеПерсоналом КАК ВариантыОбеспеченияПерсоналомАутсорсингОбеспечениеПерсоналом"+Строка(Сч)+"
        |		ПО ВариантыОбеспеченияПерсоналомАутсорсингОбеспечениеПерсоналом"+Строка(Сч)+".Ссылка = ВариантыОбеспеченияПерсоналомАутсорсинг.Ссылка
        |			И (ВариантыОбеспеченияПерсоналомАутсорсингОбеспечениеПерсоналом"+Строка(Сч)+".Должность.Наименование = """+ВыборкаДетальныеЗаписи.ДолжностьНаименование+""")";
	КонецЦикла;
	РеквизитСписок.ТекстЗапроса="ВЫБРАТЬ
	                            |	ВариантыОбеспеченияПерсоналомАутсорсинг.Наименование,
	                            |	ВариантыОбеспеченияПерсоналомАутсорсинг.Код"+Текст1+"
	                            |ИЗ
	                            |	Справочник.ВариантыОбеспеченияПерсоналомАутсорсинг КАК ВариантыОбеспеченияПерсоналомАутсорсинг"+Текст2+"
								| Сгруппировать по ВариантыОбеспеченияПерсоналомАутсорсинг.Наименование,
	                            |	ВариантыОбеспеченияПерсоналомАутсорсинг.Код";
  	ВыборкаДетальныеЗаписи.Сбросить();
    РеквизитСписок.ОсновнаяТаблица="Справочник.ВариантыОбеспеченияПерсоналомАутсорсинг";
	
	НовЭл=Элементы.Добавить("ЭлементСписок",Тип("ТаблицаФормы"));
	НовЭл.ПутьКДанным="СписокДин";
	НовЭл.УстановитьДействие("ПередНачаломДобавления","СписокПередНачаломДобавления");
	
	НоваяКолонка=Элементы.Добавить("КолонкаНаименование",Тип("ПолеФормы"),НовЭл);
	НоваяКолонка.ПутьКДанным="СписокДин.Наименование";
	
	НоваяКолонка=Элементы.Добавить("КолонкаКод",Тип("ПолеФормы"),НовЭл);
	НоваяКолонка.ПутьКДанным="СписокДин.Код";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяКолонка=Элементы.Добавить("Колонка"+СтрЗаменить(ВыборкаДетальныеЗаписи.ДолжностьНаименование," ",""),Тип("ПолеФормы"),НовЭл);
		НоваяКолонка.ПутьКДанным="СписокДин."+СтрЗаменить(ВыборкаДетальныеЗаписи.ДолжностьНаименование," ","");
	КонецЦикла;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОтчетПоДолжностям(Команда)
	Струк=Новый Структура("СформироватьПриОткрытии",Истина);
	ОткрытьФорму("Отчет.ОтчетПоДолжностямАутсорсинг.Форма",Струк);
КонецПроцедуры
